define(['JQuery'],function($) {
	var idNum = 0; //id计数器,用于绑定对应的弹出框
	var callCache = {}; //函数缓存

	/*
	 * 初始化函数
	 * 参数为json对象
	 * 	属性selector:字符串类型,元素选择器（例如：#ele;.ele）
	 * 	属性shownCallBack:Function类型,显示出来的时候回调函数
	 * 	属性hiddenCallBack:Function类型,隐藏完毕后的回调函数
	 * */
	var init = function(options) {
		var _default = {
			selector: '',
			shownCallBack: null,
			hiddenCallBack: null
		};
		inheritJsonObj(_default, options);

		//获取所有的元素,准备作为外壳进行改造
		var wraps = document.querySelectorAll(_default.selector);
		//var body = document.getElementsByTagName('body')[0];

		for(var i = 0; i < wraps.length; i++) {
			/*-------- 获取外壳引用,构建内部结构    -------*/
			var wrap = wraps[i];

			//避免重复配置
			if(wrap.hasAttribute('data-id')) {
				continue;
			}

			callCache['shownCallBack' + idNum] = _default.shownCallBack;
			callCache['hiddenCallBack' + idNum] = _default.hiddenCallBack;

			//给外壳添加专属类名和自定义id属性
			addClassName.call(wrap,'wp_citySelect');
			wrap.setAttribute('data-id', 'wpCS_' + idNum);
			wrap.innerHTML = '<div class="clickArea"><input type="text" placeholder="请选择" readonly/><span class="arrow"></span></div>'

			//在外壳中追加一个选择容器(判断是为了避免多次追加)
			var sContainer = document.createElement('div');
			addClassName.call(sContainer,'wp_citySelectContainer');
			sContainer.setAttribute('data-id', 'wpCS_' + idNum);
			if(!wrap.contains(sContainer)) {
				wrap.appendChild(sContainer);

				//向选择容器内部添加省市内容结构
				sContainer.innerHTML = '<div class="p"></div><div class="c"></div>';

				//获取内部容器
				var p = sContainer.getElementsByClassName('p')[0];
				var c = sContainer.getElementsByClassName('c')[0];

				//初始化省市结构
				initContainerHtml(p, c, _default);

				//事件绑定
				pickerEventBind(wrap.getElementsByClassName('clickArea')[0], sContainer, _default);
			}

			idNum++; //id计数器自增
		}
	};

	//初始化省市结构
	var initContainerHtml = function(p, c, _default) {
		//加载省
        cityData["城市代码"].forEach(function(o, i, arr) {
			var item = document.createElement('div');
			addClassName.call(item,'pItem');
			item.innerText = o['省']["省名"];
            item.setAttribute('data-code',o['省']["编码"]);

			//监听省点击事件
			item.addEventListener('click', function(e) {
				var pStr = this.innerText; //获取当前省,为了加载对应市区

				//添加样式
				var selectItem = p.querySelector('.pActive');
				if(checkObjIsExit(selectItem)) {
					removeClassName.call(p.querySelector('.pActive'),'pActive');
				}

				addClassName.call(this,'pActive');

				loadCity(c, pStr, o['市'], _default); //加载市区
			});

			p.appendChild(item);
		});
	};

	//加载市区
	var loadCity = function(c, pStr , cityArr, _default) {
		//先清空容器
		c.innerHTML = '';

		//遍历市区,将市区元素追加到容器内
        cityArr.forEach(function(o, i, arr) {
			var item = document.createElement('span');
			addClassName.call(item,'cItem');
			item.innerText = o['市名'];
            item.setAttribute('data-code',o["编码"]);
			c.appendChild(item);

			//监听市点击事件
			item.addEventListener('click', function(e) {
				var cText = this.innerText; //获取市区文本				
				var container = $(this).closest('.wp_citySelectContainer')[0]; //获取当前点击的选择容器
				var picker = container.previousElementSibling.getElementsByTagName('input')[0]; //获取input元素，方便赋值

				//添加点击样式
				var selectItem = c.querySelector('.cActive');
				if(checkObjIsExit(selectItem)) {
					removeClassName.call(c.querySelector('.cActive'),'cActive');
				}
				addClassName.call(this,'pActive');

				setValue(picker, pStr, cText,this); //设置值到input上
			});
		});
	};

	//赋值到input上(参数1为input元素,参数2为省字符串,参数3为市字符串)
	var setValue = function(picker, pStr, cText,cEle) {
		//如果像澳门 澳门这种省市相同的就只需要赋值一个就行了
		/*if(pStr !== cText) {
			picker.value = pStr + ' ' + cText;
		} else {
			picker.value = cText;
		}*/

        picker.value = pStr + ' ' + cText;

		var wrap = $(picker).closest('.wp_citySelect')[0]; //获取外部容器方便给数据
		wrap.setAttribute('data-value', picker.value);
        wrap.setAttribute('data-pCode', $(cEle).closest('.c')[0].previousElementSibling.getElementsByClassName('pActive')[0].getAttribute('data-code'));//设置省编码
        wrap.setAttribute('data-cCode', cEle.getAttribute('data-code'));//设置市编码

		//设置完值后隐藏容器
		hide($(picker).closest('.wp_citySelect')[0]);
	};

	//选择触发器事件绑定
	var pickerEventBind = function(picker, container, _default) {
		picker.addEventListener('click', function(e) {
			/*----------- 通过触发初始化点击省来加载市级结构  -----------*/
			var fstPEle = container.querySelector('.p .pItem');

			//兼容IE和高级浏览器的事件触发
			/*if(getCurBrowser().indexOf('IE') !== -1) {
				var e = document.createEventObject();
				e.eventType = 'onclick';
				fstPEle.fireEvent('onclick', e);
			} else {
				var e = document.createEvent("HTMLEvents");
				e.initEvent("click", false, false);
				fstPEle.dispatchEvent(e, 'click');
			}*/

			$(fstPEle).trigger('click');

			//显示选择容器
			show($(picker).closest('.wp_citySelect')[0], _default);
		});
	};

	//显示函数
	var show = function(selector, _default) {
		var container = null;
		if(typeof selector === 'string') {
			container = document.querySelector(selector + ' .wp_citySelectContainer');
		} else {
			container = selector.querySelector('.wp_citySelectContainer');
		}

		//样式设置
		setPos(container);
		container.style.display = 'block';

		var num = container.getAttribute('data-id').slice(5);
		if(callCache['shownCallBack' + num] !== null) {
			callCache['shownCallBack' + num](container);
		}
	};

	//位置设置
	var setPos = function(container) {
		var pOffsetTop = container.parentElement.offsetTop; //获取容器顶部位置
		var pHeight = container.parentElement.offsetHeight; //获取选择触发器高度
		var cHeight = 146; //获取本身容器高度
		var wHeight = window.innerHeight; //获取窗体内部高度

		//避免超出窗体
		if(pOffsetTop + cHeight >= wHeight) {
			container.style.top = (0 - cHeight) + 'px';
		} else {
			container.style.top = (pHeight) + 'px';
		}
	};

	//隐藏函数
	var hide = function(selector) {
		var container = null;
		if(typeof selector === 'string') {
			container = document.querySelector(selector + ' .wp_citySelectContainer');
		} else {
			container = selector.querySelector('.wp_citySelectContainer');
		}

		container.style.display = 'none';

		var num = container.getAttribute('data-id').slice(5);
		if(callCache['hiddenCallBack' + num] !== null) {
			callCache['hiddenCallBack' + num](container);
		}
	};

	//隐藏控制
	document.onmousedown = function(e){
		var target = e.target;

		if(!$(target).is('.wp_citySelectContainer') && $('.wp_citySelectContainer').has(target).length == 0){
			$('.wp_citySelectContainer').css('display','none');
		}
	};

	//暴露给外界的方法
	return {
		init: init
	};
});

//检测对象是否存在
function checkObjIsExit(obj) {
	var isNoExit = (obj === undefined || obj === null || obj === '' || obj.length === 0 || obj === 'undefined' ||
		obj === 'null');
	if(isNoExit) {
		return false;
	} else {
		return true;
	}
}

//继承对象属性
function inheritJsonObj(c, p) {
	for(var key in p) {
		if(key != undefined) {
			c[key] = p[key];
		}
	}
}

function addClassName(value) {
	var cName = this.className;
	if(cName.indexOf(value) === -1) {
		this.className = this.className + ' ' + value;

		//如果类名在第一个则移除前面的空格
		if(this.className === (' ' + value)) {
			this.className = this.className.slice(1);
		}
	}
};

function removeClassName(value) {
	var cName = this.className;

	//如果类名是第一个则直接移除,否则将空格包含一起移除
	if(cName.indexOf(value) === 0) {
		this.className = cName.replace(value, '');
	} else if(cName.indexOf(value) !== -1 && cName.indexOf(value) !== 0) {
		this.className = cName.replace(' ' + value, '');
	}
};

/*   测试浏览器FF Chrome IE11 IE10 IE9  Edge */
function getCurBrowser() {
	var webInfo = navigator.userAgent;
	var chromeVendor = navigator.vendor;
	if(webInfo.indexOf('OPR') !== -1) {
		return 'Opera';
	} else if(webInfo.indexOf('Edge') !== -1) {
		return 'Edge';
	} else if(webInfo.indexOf('Firefox') !== -1) {
		return 'FF';
	} else if(webInfo.indexOf('MSIE 9.0') !== -1) {
		return 'IE9';
	} else if(webInfo.indexOf('MSIE 10.0') !== -1) {
		return 'IE10';
	} else if(webInfo.indexOf('Trident') !== -1) {
		return 'IE11';
	} else if((chromeVendor != '' && chromeVendor != undefined && chromeVendor != null && chromeVendor.indexOf('Google') !== -1) || webInfo.indexOf('Chrome') !== -1) {
		return 'Chrome';
	} else {
		return 'other';
	}
}

//快乐work要求的城市代码
var cityData = {
	"城市代码": [
		{
			"省":
			{
				"编码": "110000",
				"省名": "北京"
			},
			"市": [
				{
					"编码": "110101",
					"市名": "东城"
				},
				{
					"编码": "110102",
					"市名": "西城"
				},
				{
					"编码": "110105",
					"市名": "朝阳"
				},
				{
					"编码": "110106",
					"市名": "丰台"
				},
				{
					"编码": "110107",
					"市名": "石景山"
				},
				{
					"编码": "110108",
					"市名": "海淀"
				},
				{
					"编码": "110109",
					"市名": "门头沟"
				},
				{
					"编码": "110111",
					"市名": "房山"
				},
				{
					"编码": "110112",
					"市名": "通州"
				},
				{
					"编码": "110113",
					"市名": "顺义"
				},
				{
					"编码": "110114",
					"市名": "昌平"
				},
				{
					"编码": "110115",
					"市名": "大兴"
				},
				{
					"编码": "110116",
					"市名": "怀柔"
				},
				{
					"编码": "110117",
					"市名": "平谷"
				},
				{
					"编码": "110228",
					"市名": "密云"
				},
				{
					"编码": "110229",
					"市名": "延庆"
				}
			]
		},
		{
			"省":
			{
				"编码": "120000",
				"省名": "天津"
			},
			"市": [
				{
					"编码": "120101",
					"市名": "和平"
				},
				{
					"编码": "120102",
					"市名": "河东"
				},
				{
					"编码": "120103",
					"市名": "河西"
				},
				{
					"编码": "120104",
					"市名": "南开"
				},
				{
					"编码": "120105",
					"市名": "河北"
				},
				{
					"编码": "120106",
					"市名": "红桥"
				},
				{
					"编码": "120110",
					"市名": "东丽"
				},
				{
					"编码": "120111",
					"市名": "西青"
				},
				{
					"编码": "120112",
					"市名": "津南"
				},
				{
					"编码": "120113",
					"市名": "北辰"
				},
				{
					"编码": "120114",
					"市名": "武清"
				},
				{
					"编码": "120115",
					"市名": "宝坻"
				},
				{
					"编码": "120116",
					"市名": "滨海"
				},
				{
					"编码": "120117",
					"市名": "宁河"
				},
				{
					"编码": "120118",
					"市名": "静海"
				},
				{
					"编码": "120225",
					"市名": "蓟县"
				}
			]
		},
		{
			"省":
			{
				"编码": "310000",
				"省名": "上海"
			},
			"市": [
				{
					"编码": "310101",
					"市名": "黄浦"
				},
				{
					"编码": "310104",
					"市名": "徐汇"
				},
				{
					"编码": "310105",
					"市名": "长宁"
				},
				{
					"编码": "310106",
					"市名": "静安"
				},
				{
					"编码": "310107",
					"市名": "普陀"
				},
				{
					"编码": "310108",
					"市名": "闸北"
				},
				{
					"编码": "310109",
					"市名": "虹口"
				},
				{
					"编码": "310110",
					"市名": "杨浦"
				},
				{
					"编码": "310112",
					"市名": "闵行"
				},
				{
					"编码": "310113",
					"市名": "宝山"
				},
				{
					"编码": "310114",
					"市名": "嘉定"
				},
				{
					"编码": "310115",
					"市名": "浦东"
				},
				{
					"编码": "310116",
					"市名": "金山"
				},
				{
					"编码": "310117",
					"市名": "松江"
				},
				{
					"编码": "310118",
					"市名": "青浦"
				},
				{
					"编码": "310120",
					"市名": "奉贤"
				},
				{
					"编码": "310230",
					"市名": "崇明"
				}
			]
		},
		{
			"省":
			{
				"编码": "130000",
				"省名": "河北"
			},
			"市": [
				{
					"编码": "130100",
					"市名": "石家庄"
				},
				{
					"编码": "130200",
					"市名": "唐山"
				},
				{
					"编码": "130300",
					"市名": "秦皇岛"
				},
				{
					"编码": "130400",
					"市名": "邯郸"
				},
				{
					"编码": "130500",
					"市名": "邢台"
				},
				{
					"编码": "130600",
					"市名": "保定"
				},
				{
					"编码": "130700",
					"市名": "张家口"
				},
				{
					"编码": "130800",
					"市名": "承德"
				},
				{
					"编码": "130900",
					"市名": "沧州"
				},
				{
					"编码": "131000",
					"市名": "廊坊"
				},
				{
					"编码": "131100",
					"市名": "衡水"
				},
				{
					"编码": "139001",
					"市名": "定州"
				},
				{
					"编码": "139002",
					"市名": "辛集"
				}
			]
		},
		{
			"省":
			{
				"编码": "410000",
				"省名": "河南"
			},
			"市": [
				{
					"编码": "410100",
					"市名": "郑州"
				},
				{
					"编码": "410200",
					"市名": "开封"
				},
				{
					"编码": "410300",
					"市名": "洛阳"
				},
				{
					"编码": "410400",
					"市名": "平顶山"
				},
				{
					"编码": "410500",
					"市名": "安阳"
				},
				{
					"编码": "410600",
					"市名": "鹤壁"
				},
				{
					"编码": "410700",
					"市名": "新乡"
				},
				{
					"编码": "410800",
					"市名": "焦作"
				},
				{
					"编码": "410900",
					"市名": "濮阳"
				},
				{
					"编码": "411000",
					"市名": "许昌"
				},
				{
					"编码": "411100",
					"市名": "漯河"
				},
				{
					"编码": "411200",
					"市名": "三门峡"
				},
				{
					"编码": "411300",
					"市名": "南阳"
				},
				{
					"编码": "411400",
					"市名": "商丘"
				},
				{
					"编码": "411500",
					"市名": "信阳"
				},
				{
					"编码": "411600",
					"市名": "周口"
				},
				{
					"编码": "411700",
					"市名": "驻马店"
				},
				{
					"编码": "419001",
					"市名": "济源"
				}
			]
		},
		{
			"省":
			{
				"编码": "340000",
				"省名": "安徽"
			},
			"市": [
				{
					"编码": "340100",
					"市名": "合肥"
				},
				{
					"编码": "340200",
					"市名": "芜湖"
				},
				{
					"编码": "340300",
					"市名": "蚌埠"
				},
				{
					"编码": "340400",
					"市名": "淮南"
				},
				{
					"编码": "340500",
					"市名": "马鞍山"
				},
				{
					"编码": "340600",
					"市名": "淮北"
				},
				{
					"编码": "340700",
					"市名": "铜陵"
				},
				{
					"编码": "340800",
					"市名": "安庆"
				},
				{
					"编码": "341000",
					"市名": "黄山"
				},
				{
					"编码": "341100",
					"市名": "滁州"
				},
				{
					"编码": "341200",
					"市名": "阜阳"
				},
				{
					"编码": "341300",
					"市名": "宿州"
				},
				{
					"编码": "341500",
					"市名": "六安"
				},
				{
					"编码": "341600",
					"市名": "亳州"
				},
				{
					"编码": "341700",
					"市名": "池州"
				},
				{
					"编码": "341800",
					"市名": "宣城"
				}
			]
		},
		{
			"省":
			{
				"编码": "330000",
				"省名": "浙江"
			},
			"市": [
				{
					"编码": "330100",
					"市名": "杭州"
				},
				{
					"编码": "330200",
					"市名": "宁波"
				},
				{
					"编码": "330300",
					"市名": "温州"
				},
				{
					"编码": "330400",
					"市名": "嘉兴"
				},
				{
					"编码": "330500",
					"市名": "湖州"
				},
				{
					"编码": "330600",
					"市名": "绍兴"
				},
				{
					"编码": "330700",
					"市名": "金华"
				},
				{
					"编码": "330800",
					"市名": "衢州"
				},
				{
					"编码": "330900",
					"市名": "舟山"
				},
				{
					"编码": "331000",
					"市名": "台州"
				},
				{
					"编码": "331100",
					"市名": "丽水"
				}
			]
		},
		{
			"省":
			{
				"编码": "500000",
				"省名": "重庆"
			},
			"市": [
				{
					"编码": "500101",
					"市名": "万州"
				},
				{
					"编码": "500102",
					"市名": "涪陵"
				},
				{
					"编码": "500103",
					"市名": "渝中"
				},
				{
					"编码": "500104",
					"市名": "大渡口"
				},
				{
					"编码": "500105",
					"市名": "江北"
				},
				{
					"编码": "500106",
					"市名": "沙坪坝"
				},
				{
					"编码": "500107",
					"市名": "九龙坡"
				},
				{
					"编码": "500108",
					"市名": "南岸"
				},
				{
					"编码": "500109",
					"市名": "北碚"
				},
				{
					"编码": "500110",
					"市名": "綦江"
				},
				{
					"编码": "500111",
					"市名": "大足"
				},
				{
					"编码": "500112",
					"市名": "渝北"
				},
				{
					"编码": "500113",
					"市名": "巴南"
				},
				{
					"编码": "500114",
					"市名": "黔江"
				},
				{
					"编码": "500115",
					"市名": "长寿"
				},
				{
					"编码": "500116",
					"市名": "江津"
				},
				{
					"编码": "500117",
					"市名": "合川"
				},
				{
					"编码": "500118",
					"市名": "永川"
				},
				{
					"编码": "500119",
					"市名": "南川"
				},
				{
					"编码": "500120",
					"市名": "璧山"
				},
				{
					"编码": "500151",
					"市名": "铜梁"
				},
				{
					"编码": "500152",
					"市名": "潼南"
				},
				{
					"编码": "500153",
					"市名": "荣昌"
				},
				{
					"编码": "500228",
					"市名": "梁平"
				},
				{
					"编码": "500229",
					"市名": "城口"
				},
				{
					"编码": "500230",
					"市名": "丰都"
				},
				{
					"编码": "500231",
					"市名": "垫江"
				},
				{
					"编码": "500232",
					"市名": "武隆"
				},
				{
					"编码": "500233",
					"市名": "忠"
				},
				{
					"编码": "500234",
					"市名": "开"
				},
				{
					"编码": "500235",
					"市名": "云阳"
				},
				{
					"编码": "500236",
					"市名": "奉节"
				},
				{
					"编码": "500237",
					"市名": "巫山"
				},
				{
					"编码": "500238",
					"市名": "巫溪"
				},
				{
					"编码": "500240",
					"市名": "石柱"
				},
				{
					"编码": "500241",
					"市名": "秀山"
				},
				{
					"编码": "500242",
					"市名": "酉阳"
				},
				{
					"编码": "500243",
					"市名": "彭水"
				}
			]
		},
		{
			"省":
			{
				"编码": "350000",
				"省名": "福建"
			},
			"市": [
				{
					"编码": "350100",
					"市名": "福州"
				},
				{
					"编码": "350200",
					"市名": "厦门"
				},
				{
					"编码": "350300",
					"市名": "莆田"
				},
				{
					"编码": "350400",
					"市名": "三明"
				},
				{
					"编码": "350500",
					"市名": "泉州"
				},
				{
					"编码": "350600",
					"市名": "漳州"
				},
				{
					"编码": "350700",
					"市名": "南平"
				},
				{
					"编码": "350800",
					"市名": "龙岩"
				},
				{
					"编码": "350900",
					"市名": "宁德"
				}
			]
		},
		{
			"省":
			{
				"编码": "620000",
				"省名": "甘肃"
			},
			"市": [
				{
					"编码": "620100",
					"市名": "兰州"
				},
				{
					"编码": "620200",
					"市名": "嘉峪关"
				},
				{
					"编码": "620300",
					"市名": "金昌"
				},
				{
					"编码": "620400",
					"市名": "白银"
				},
				{
					"编码": "620500",
					"市名": "天水"
				},
				{
					"编码": "620600",
					"市名": "武威"
				},
				{
					"编码": "620700",
					"市名": "张掖"
				},
				{
					"编码": "620800",
					"市名": "平凉"
				},
				{
					"编码": "620900",
					"市名": "酒泉"
				},
				{
					"编码": "621000",
					"市名": "庆阳"
				},
				{
					"编码": "621100",
					"市名": "定西"
				},
				{
					"编码": "621200",
					"市名": "陇南"
				},
				{
					"编码": "622900",
					"市名": "临夏"
				},
				{
					"编码": "623000",
					"市名": "甘南"
				}
			]
		},
		{
			"省":
			{
				"编码": "440000",
				"省名": "广东"
			},
			"市": [
				{
					"编码": "440100",
					"市名": "广州"
				},
				{
					"编码": "440200",
					"市名": "韶关"
				},
				{
					"编码": "440300",
					"市名": "深圳"
				},
				{
					"编码": "440400",
					"市名": "珠海"
				},
				{
					"编码": "440500",
					"市名": "汕头"
				},
				{
					"编码": "440600",
					"市名": "佛山"
				},
				{
					"编码": "440700",
					"市名": "江门"
				},
				{
					"编码": "440800",
					"市名": "湛江"
				},
				{
					"编码": "440900",
					"市名": "茂名"
				},
				{
					"编码": "441200",
					"市名": "肇庆"
				},
				{
					"编码": "441300",
					"市名": "惠州"
				},
				{
					"编码": "441400",
					"市名": "梅州"
				},
				{
					"编码": "441500",
					"市名": "汕尾"
				},
				{
					"编码": "441600",
					"市名": "河源"
				},
				{
					"编码": "441700",
					"市名": "阳江"
				},
				{
					"编码": "441800",
					"市名": "清远"
				},
				{
					"编码": "441900",
					"市名": "东莞"
				},
				{
					"编码": "442000",
					"市名": "中山"
				},
				{
					"编码": "445100",
					"市名": "潮州"
				},
				{
					"编码": "445200",
					"市名": "揭阳"
				},
				{
					"编码": "445300",
					"市名": "云浮"
				}
			]
		},
		{
			"省":
			{
				"编码": "450000",
				"省名": "广西"
			},
			"市": [
				{
					"编码": "450100",
					"市名": "南宁"
				},
				{
					"编码": "450200",
					"市名": "柳州"
				},
				{
					"编码": "450300",
					"市名": "桂林"
				},
				{
					"编码": "450400",
					"市名": "梧州"
				},
				{
					"编码": "450500",
					"市名": "北海"
				},
				{
					"编码": "450600",
					"市名": "防城港"
				},
				{
					"编码": "450700",
					"市名": "钦州"
				},
				{
					"编码": "450800",
					"市名": "贵港"
				},
				{
					"编码": "450900",
					"市名": "玉林"
				},
				{
					"编码": "451000",
					"市名": "百色"
				},
				{
					"编码": "451100",
					"市名": "贺州"
				},
				{
					"编码": "451200",
					"市名": "河池"
				},
				{
					"编码": "451300",
					"市名": "来宾"
				},
				{
					"编码": "451400",
					"市名": "崇左"
				}
			]
		},
		{
			"省":
			{
				"编码": "520000",
				"省名": "贵州"
			},
			"市": [
				{
					"编码": "520100",
					"市名": "贵阳"
				},
				{
					"编码": "520200",
					"市名": "六盘水"
				},
				{
					"编码": "520300",
					"市名": "遵义"
				},
				{
					"编码": "520400",
					"市名": "安顺"
				},
				{
					"编码": "520500",
					"市名": "毕节"
				},
				{
					"编码": "520600",
					"市名": "铜仁"
				},
				{
					"编码": "522300",
					"市名": "黔西南"
				},
				{
					"编码": "522600",
					"市名": "黔东南"
				},
				{
					"编码": "522700",
					"市名": "黔南"
				}
			]
		},
		{
			"省":
			{
				"编码": "530000",
				"省名": "云南"
			},
			"市": [
				{
					"编码": "530100",
					"市名": "昆明"
				},
				{
					"编码": "530300",
					"市名": "曲靖"
				},
				{
					"编码": "530400",
					"市名": "玉溪"
				},
				{
					"编码": "530500",
					"市名": "保山"
				},
				{
					"编码": "530600",
					"市名": "昭通"
				},
				{
					"编码": "530700",
					"市名": "丽江"
				},
				{
					"编码": "530800",
					"市名": "普洱"
				},
				{
					"编码": "530900",
					"市名": "临沧"
				},
				{
					"编码": "532300",
					"市名": "楚雄"
				},
				{
					"编码": "532500",
					"市名": "红河"
				},
				{
					"编码": "532600",
					"市名": "文山"
				},
				{
					"编码": "532800",
					"市名": "西双版纳"
				},
				{
					"编码": "532900",
					"市名": "大理"
				},
				{
					"编码": "533100",
					"市名": "德宏"
				},
				{
					"编码": "533300",
					"市名": "怒江"
				},
				{
					"编码": "533400",
					"市名": "迪庆"
				}
			]
		},
		{
			"省":
			{
				"编码": "150000",
				"省名": "内蒙古"
			},
			"市": [
				{
					"编码": "150100",
					"市名": "呼和浩特"
				},
				{
					"编码": "150200",
					"市名": "包头"
				},
				{
					"编码": "150300",
					"市名": "乌海"
				},
				{
					"编码": "150400",
					"市名": "赤峰"
				},
				{
					"编码": "150500",
					"市名": "通辽"
				},
				{
					"编码": "150600",
					"市名": "鄂尔多斯"
				},
				{
					"编码": "150700",
					"市名": "呼伦贝尔"
				},
				{
					"编码": "150800",
					"市名": "巴彦淖尔"
				},
				{
					"编码": "150900",
					"市名": "乌兰察布"
				},
				{
					"编码": "152200",
					"市名": "兴安"
				},
				{
					"编码": "152500",
					"市名": "锡林郭勒"
				},
				{
					"编码": "152900",
					"市名": "阿拉善"
				}
			]
		},
		{
			"省":
			{
				"编码": "360000",
				"省名": "江西"
			},
			"市": [
				{
					"编码": "360100",
					"市名": "南昌"
				},
				{
					"编码": "360200",
					"市名": "景德镇"
				},
				{
					"编码": "360300",
					"市名": "萍乡"
				},
				{
					"编码": "360400",
					"市名": "九江"
				},
				{
					"编码": "360500",
					"市名": "新余"
				},
				{
					"编码": "360600",
					"市名": "鹰潭"
				},
				{
					"编码": "360700",
					"市名": "赣州"
				},
				{
					"编码": "360800",
					"市名": "吉安"
				},
				{
					"编码": "360900",
					"市名": "宜春"
				},
				{
					"编码": "361000",
					"市名": "抚州"
				},
				{
					"编码": "361100",
					"市名": "上饶"
				}
			]
		},
		{
			"省":
			{
				"编码": "420000",
				"省名": "湖北"
			},
			"市": [
				{
					"编码": "420100",
					"市名": "武汉"
				},
				{
					"编码": "420200",
					"市名": "黄石"
				},
				{
					"编码": "420300",
					"市名": "十堰"
				},
				{
					"编码": "420500",
					"市名": "宜昌"
				},
				{
					"编码": "420600",
					"市名": "襄阳"
				},
				{
					"编码": "420700",
					"市名": "鄂州"
				},
				{
					"编码": "420800",
					"市名": "荆门"
				},
				{
					"编码": "420900",
					"市名": "孝感"
				},
				{
					"编码": "421000",
					"市名": "荆州"
				},
				{
					"编码": "421100",
					"市名": "黄冈"
				},
				{
					"编码": "421200",
					"市名": "咸宁"
				},
				{
					"编码": "421300",
					"市名": "随州"
				},
				{
					"编码": "422800",
					"市名": "恩施"
				},
				{
					"编码": "429004",
					"市名": "仙桃"
				},
				{
					"编码": "429005",
					"市名": "潜江"
				},
				{
					"编码": "429006",
					"市名": "天门"
				},
				{
					"编码": "429021",
					"市名": "神农架"
				}
			]
		},
		{
			"省":
			{
				"编码": "510000",
				"省名": "四川"
			},
			"市": [
				{
					"编码": "510100",
					"市名": "成都"
				},
				{
					"编码": "510300",
					"市名": "自贡"
				},
				{
					"编码": "510400",
					"市名": "攀枝花"
				},
				{
					"编码": "510500",
					"市名": "泸州"
				},
				{
					"编码": "510600",
					"市名": "德阳"
				},
				{
					"编码": "510700",
					"市名": "绵阳"
				},
				{
					"编码": "510800",
					"市名": "广元"
				},
				{
					"编码": "510900",
					"市名": "遂宁"
				},
				{
					"编码": "511000",
					"市名": "内江"
				},
				{
					"编码": "511100",
					"市名": "乐山"
				},
				{
					"编码": "511300",
					"市名": "南充"
				},
				{
					"编码": "511400",
					"市名": "眉山"
				},
				{
					"编码": "511500",
					"市名": "宜宾"
				},
				{
					"编码": "511600",
					"市名": "广安"
				},
				{
					"编码": "511700",
					"市名": "达州"
				},
				{
					"编码": "511800",
					"市名": "雅安"
				},
				{
					"编码": "511900",
					"市名": "巴中"
				},
				{
					"编码": "512000",
					"市名": "资阳"
				},
				{
					"编码": "513200",
					"市名": "阿坝"
				},
				{
					"编码": "513300",
					"市名": "甘孜"
				},
				{
					"编码": "513400",
					"市名": "凉山"
				}
			]
		},
		{
			"省":
			{
				"编码": "640000",
				"省名": "宁夏"
			},
			"市": [
				{
					"编码": "640100",
					"市名": "银川"
				},
				{
					"编码": "640200",
					"市名": "石嘴山"
				},
				{
					"编码": "640300",
					"市名": "吴忠"
				},
				{
					"编码": "640400",
					"市名": "固原"
				},
				{
					"编码": "640500",
					"市名": "中卫"
				}
			]
		},
		{
			"省":
			{
				"编码": "630000",
				"省名": "青海"
			},
			"市": [
				{
					"编码": "630100",
					"市名": "西宁"
				},
				{
					"编码": "630200",
					"市名": "海东"
				},
				{
					"编码": "632200",
					"市名": "海北"
				},
				{
					"编码": "632300",
					"市名": "黄南"
				},
				{
					"编码": "632500",
					"市名": "海南"
				},
				{
					"编码": "632600",
					"市名": "果洛"
				},
				{
					"编码": "632700",
					"市名": "玉树"
				},
				{
					"编码": "632800",
					"市名": "海西"
				}
			]
		},
		{
			"省":
			{
				"编码": "370000",
				"省名": "山东"
			},
			"市": [
				{
					"编码": "370100",
					"市名": "济南"
				},
				{
					"编码": "370200",
					"市名": "青岛"
				},
				{
					"编码": "370300",
					"市名": "淄博"
				},
				{
					"编码": "370400",
					"市名": "枣庄"
				},
				{
					"编码": "370500",
					"市名": "东营"
				},
				{
					"编码": "370600",
					"市名": "烟台"
				},
				{
					"编码": "370700",
					"市名": "潍坊"
				},
				{
					"编码": "370800",
					"市名": "济宁"
				},
				{
					"编码": "370900",
					"市名": "泰安"
				},
				{
					"编码": "371000",
					"市名": "威海"
				},
				{
					"编码": "371100",
					"市名": "日照"
				},
				{
					"编码": "371200",
					"市名": "莱芜"
				},
				{
					"编码": "371300",
					"市名": "临沂"
				},
				{
					"编码": "371400",
					"市名": "德州"
				},
				{
					"编码": "371500",
					"市名": "聊城"
				},
				{
					"编码": "371600",
					"市名": "滨州"
				},
				{
					"编码": "371700",
					"市名": "菏泽"
				}
			]
		},
		{
			"省":
			{
				"编码": "610000",
				"省名": "陕西"
			},
			"市": [
				{
					"编码": "610100",
					"市名": "西安"
				},
				{
					"编码": "610200",
					"市名": "铜川"
				},
				{
					"编码": "610300",
					"市名": "宝鸡"
				},
				{
					"编码": "610400",
					"市名": "咸阳"
				},
				{
					"编码": "610500",
					"市名": "渭南"
				},
				{
					"编码": "610600",
					"市名": "延安"
				},
				{
					"编码": "610700",
					"市名": "汉中"
				},
				{
					"编码": "610800",
					"市名": "榆林"
				},
				{
					"编码": "610900",
					"市名": "安康"
				},
				{
					"编码": "611000",
					"市名": "商洛"
				}
			]
		},
		{
			"省":
			{
				"编码": "140000",
				"省名": "山西"
			},
			"市": [
				{
					"编码": "140100",
					"市名": "太原"
				},
				{
					"编码": "140200",
					"市名": "大同"
				},
				{
					"编码": "140300",
					"市名": "阳泉"
				},
				{
					"编码": "140400",
					"市名": "长治"
				},
				{
					"编码": "140500",
					"市名": "晋城"
				},
				{
					"编码": "140600",
					"市名": "朔州"
				},
				{
					"编码": "140700",
					"市名": "晋中"
				},
				{
					"编码": "140800",
					"市名": "运城"
				},
				{
					"编码": "140900",
					"市名": "忻州"
				},
				{
					"编码": "141000",
					"市名": "临汾"
				},
				{
					"编码": "141100",
					"市名": "吕梁"
				}
			]
		},
		{
			"省":
			{
				"编码": "650000",
				"省名": "新疆"
			},
			"市": [
				{
					"编码": "650100",
					"市名": "乌鲁木齐"
				},
				{
					"编码": "650200",
					"市名": "克拉玛依"
				},
				{
					"编码": "650400",
					"市名": "吐鲁番"
				},
				{
					"编码": "652200",
					"市名": "哈密"
				},
				{
					"编码": "652300",
					"市名": "昌吉"
				},
				{
					"编码": "652700",
					"市名": "博尔塔拉"
				},
				{
					"编码": "652800",
					"市名": "巴音郭楞"
				},
				{
					"编码": "652900",
					"市名": "阿克苏"
				},
				{
					"编码": "653000",
					"市名": "克孜勒苏"
				},
				{
					"编码": "653100",
					"市名": "喀什"
				},
				{
					"编码": "653200",
					"市名": "和田"
				},
				{
					"编码": "654000",
					"市名": "伊犁"
				},
				{
					"编码": "654200",
					"市名": "塔城"
				},
				{
					"编码": "654300",
					"市名": "阿勒泰"
				},
				{
					"编码": "659001",
					"市名": "石河子"
				},
				{
					"编码": "659002",
					"市名": "阿拉尔"
				},
				{
					"编码": "659003",
					"市名": "图木舒克"
				},
				{
					"编码": "659004",
					"市名": "五家渠"
				}
			]
		},
		{
			"省":
			{
				"编码": "540000",
				"省名": "西藏"
			},
			"市": [
				{
					"编码": "540100",
					"市名": "拉萨"
				},
				{
					"编码": "540200",
					"市名": "日喀则"
				},
				{
					"编码": "540300",
					"市名": "昌都"
				},
				{
					"编码": "540400",
					"市名": "林芝"
				},
				{
					"编码": "542200",
					"市名": "山南"
				},
				{
					"编码": "542400",
					"市名": "那曲"
				},
				{
					"编码": "542500",
					"市名": "阿里"
				}
			]
		},
		{
			"省":
			{
				"编码": "230000",
				"省名": "黑龙江"
			},
			"市": [
				{
					"编码": "230100",
					"市名": "哈尔滨"
				},
				{
					"编码": "230200",
					"市名": "齐齐哈尔"
				},
				{
					"编码": "230300",
					"市名": "鸡西"
				},
				{
					"编码": "230400",
					"市名": "鹤岗"
				},
				{
					"编码": "230500",
					"市名": "双鸭山"
				},
				{
					"编码": "230600",
					"市名": "大庆"
				},
				{
					"编码": "230700",
					"市名": "伊春"
				},
				{
					"编码": "230800",
					"市名": "佳木斯"
				},
				{
					"编码": "230900",
					"市名": "七台河"
				},
				{
					"编码": "231000",
					"市名": "牡丹江"
				},
				{
					"编码": "231100",
					"市名": "黑河"
				},
				{
					"编码": "231200",
					"市名": "绥化"
				},
				{
					"编码": "232700",
					"市名": "大兴安岭"
				}
			]
		},
		{
			"省":
			{
				"编码": "460000",
				"省名": "海南"
			},
			"市": [
				{
					"编码": "460100",
					"市名": "海口"
				},
				{
					"编码": "460200",
					"市名": "三亚"
				},
				{
					"编码": "460300",
					"市名": "三沙"
				},
				{
					"编码": "469001",
					"市名": "五指山"
				},
				{
					"编码": "469002",
					"市名": "琼海"
				},
				{
					"编码": "469003",
					"市名": "儋州"
				},
				{
					"编码": "469005",
					"市名": "文昌"
				},
				{
					"编码": "469006",
					"市名": "万宁"
				},
				{
					"编码": "469007",
					"市名": "东方"
				},
				{
					"编码": "469021",
					"市名": "定安"
				},
				{
					"编码": "469022",
					"市名": "屯昌"
				},
				{
					"编码": "469023",
					"市名": "澄迈"
				},
				{
					"编码": "469024",
					"市名": "临高"
				},
				{
					"编码": "469025",
					"市名": "白沙"
				},
				{
					"编码": "469026",
					"市名": "昌江"
				},
				{
					"编码": "469027",
					"市名": "乐东"
				},
				{
					"编码": "469028",
					"市名": "陵水"
				},
				{
					"编码": "469029",
					"市名": "保亭"
				},
				{
					"编码": "469030",
					"市名": "琼中"
				}
			]
		},
		{
			"省":
			{
				"编码": "430000",
				"省名": "湖南"
			},
			"市": [
				{
					"编码": "430100",
					"市名": "长沙"
				},
				{
					"编码": "430200",
					"市名": "株洲"
				},
				{
					"编码": "430300",
					"市名": "湘潭"
				},
				{
					"编码": "430400",
					"市名": "衡阳"
				},
				{
					"编码": "430500",
					"市名": "邵阳"
				},
				{
					"编码": "430600",
					"市名": "岳阳"
				},
				{
					"编码": "430700",
					"市名": "常德"
				},
				{
					"编码": "430800",
					"市名": "张家界"
				},
				{
					"编码": "430900",
					"市名": "益阳"
				},
				{
					"编码": "431000",
					"市名": "郴州"
				},
				{
					"编码": "431100",
					"市名": "永州"
				},
				{
					"编码": "431200",
					"市名": "怀化"
				},
				{
					"编码": "431300",
					"市名": "娄底"
				},
				{
					"编码": "433100",
					"市名": "湘西"
				}
			]
		},
		{
			"省":
			{
				"编码": "320000",
				"省名": "江苏"
			},
			"市": [
				{
					"编码": "320100",
					"市名": "南京"
				},
				{
					"编码": "320200",
					"市名": "无锡"
				},
				{
					"编码": "320300",
					"市名": "徐州"
				},
				{
					"编码": "320400",
					"市名": "常州"
				},
				{
					"编码": "320500",
					"市名": "苏州"
				},
				{
					"编码": "320600",
					"市名": "南通"
				},
				{
					"编码": "320700",
					"市名": "连云港"
				},
				{
					"编码": "320800",
					"市名": "淮安"
				},
				{
					"编码": "320900",
					"市名": "盐城"
				},
				{
					"编码": "321000",
					"市名": "扬州"
				},
				{
					"编码": "321100",
					"市名": "镇江"
				},
				{
					"编码": "321200",
					"市名": "泰州"
				},
				{
					"编码": "321300",
					"市名": "宿迁"
				}
			]
		},
		{
			"省":
			{
				"编码": "220000",
				"省名": "吉林"
			},
			"市": [
				{
					"编码": "220100",
					"市名": "长春"
				},
				{
					"编码": "220200",
					"市名": "吉林"
				},
				{
					"编码": "220300",
					"市名": "四平"
				},
				{
					"编码": "220400",
					"市名": "辽源"
				},
				{
					"编码": "220500",
					"市名": "通化"
				},
				{
					"编码": "220600",
					"市名": "白山"
				},
				{
					"编码": "220700",
					"市名": "松原"
				},
				{
					"编码": "220800",
					"市名": "白城"
				},
				{
					"编码": "222400",
					"市名": "延边"
				}
			]
		},
		{
			"省":
			{
				"编码": "210000",
				"省名": "辽宁"
			},
			"市": [
				{
					"编码": "210100",
					"市名": "沈阳"
				},
				{
					"编码": "210200",
					"市名": "大连"
				},
				{
					"编码": "210300",
					"市名": "鞍山"
				},
				{
					"编码": "210400",
					"市名": "抚顺"
				},
				{
					"编码": "210500",
					"市名": "本溪"
				},
				{
					"编码": "210600",
					"市名": "丹东"
				},
				{
					"编码": "210700",
					"市名": "锦州"
				},
				{
					"编码": "210800",
					"市名": "营口"
				},
				{
					"编码": "210900",
					"市名": "阜新"
				},
				{
					"编码": "211000",
					"市名": "辽阳"
				},
				{
					"编码": "211100",
					"市名": "盘锦"
				},
				{
					"编码": "211200",
					"市名": "铁岭"
				},
				{
					"编码": "211300",
					"市名": "朝阳"
				},
				{
					"编码": "211400",
					"市名": "葫芦岛"
				}
			]
		},
		{
			"省":
			{
				"编码": "710000",
				"省名": "台湾"
			},
			"市": [
				{
					"市名": "台湾",
					"编码": "710100"
				}
			]
		},
		{
			"省":
			{
				"编码": "810000",
				"省名": "香港"
			},
			"市": [
				{
					"市名": "香港",
					"编码": "810100"
				}
			]
		},
		{
			"省":
			{
				"编码": "820000",
				"省名": "澳门"
			},
			"市": [
				{
					"市名": "澳门",
					"编码": "820100"
				}
			]
		}
	]
};